[Demo_Ekoro_ep7_2_ENG GG2CollectionDemoScript]
DemoScripts[0]=(Actor=FADE,Command=SET,SecTime=0,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[1]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-490,Y=1114,Z=1335),SecTime=)
DemoScripts[2]=(Actor=CAMERA,Command=SET,SetType=ROT,Vec=(X=342,Y=-5,Z=0),SecTime=)
DemoScripts[3]=(Actor=CHARACTER,Command=POP,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Vec=(X=-300,Y=1055,Z=1200),VecSub=(X=165,Y=0,Z=0),CId=21)
DemoScripts[4]=(Actor=CHARACTER,Command=POP,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Vec=(X=-300,Y=1170,Z=1200),VecSub=(X=190,Y=0,Z=0),CId=71)
DemoScripts[5]=(Actor=SYSTEM,Command=INIT_WAIT)
DemoScripts[6]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0000_lp_open_normal",motionName[1]="pt_CM_0000_fx_close_normal",motionName[2]="pt_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[7]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",motionName[1]="ek_CM_0001_fx_close_down",motionName[2]="ek_DM_0100_lp_Stand",Rate=0,Number=3,Bit=5)
DemoScripts[8]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_Serious_Ekoro.GG2_BGM_DM_Serious_Ekoro_Cue')
DemoScripts[9]=(Actor=AMBIENT,Command=PLAY,SecTime=0,SoundID=SoundCue'AMB_Rooftop.GG2_AMB_Rooftop_LP_Cue')
DemoScripts[10]=(Actor=FADE,Command=EXIT,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[11]=(Actor=FADE,Command=WAIT)
DemoScripts[12]=(Actor=WINDOW,Command=SET)
DemoScripts[13]=(Actor=TEXT,Command=SET,ID=TEXT01)
DemoScripts[14]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_002_Cue',Name="アマツカ　パタコ")
DemoScripts[15]=(Actor=TEXT,Command=SET,ID=TEXT02)
DemoScripts[16]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[17]=(Actor=WINDOW,Command=EXIT)
DemoScripts[18]=(Actor=CAMERA,Command=MOVE,SetType=POS,Vec=(X=-510,Y=1114,Z=1335),SecTime=0.5)
DemoScripts[19]=(Actor=CAMERA,Command=MOVE,SetType=ROT,Vec=(X=356,Y=-5,Z=0),SecTime=0.5)
DemoScripts[20]=(Actor=CHARACTER,Command=MOVE,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',SetType=ROT,Vec=(X=135,Y=0,Z=0),SecTime=0.5,CId=21)
DemoScripts[21]=(Actor=CHARACTER,Command=MOVE,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=-295,Y=1145,Z=1200),SecTime=0.5,CId=71)
DemoScripts[22]=(Actor=SYSTEM,Command=WAIT,SecTime=0.5)
DemoScripts[23]=(Actor=CHARACTER,Command=SET,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',SetType=POS,Vec=(X=-295,Y=1145,Z=1200),CId=71)
DemoScripts[24]=(Actor=CAMERA,Command=SET,SetType=POS,Vec=(X=-510,Y=1114,Z=1335),SecTime=)
DemoScripts[25]=(Actor=WINDOW,Command=SET)
DemoScripts[26]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_003_Cue',Name="エコロ")
DemoScripts[27]=(Actor=TEXT,Command=SET,ID=TEXT03)
DemoScripts[28]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[29]=(Actor=TEXT,Command=SET,ID=TEXT04)
DemoScripts[30]=(Actor=BGM,Command=STOP,SecTime=1,SoundID=)
DemoScripts[31]=(Actor=SYSTEM,Command=WAIT,SecTime=1)
DemoScripts[32]=(Actor=BGM,Command=PLAY,SecTime=0,SoundID=SoundCue'GG2_BGM_DM_CMN_Pinch.GG2_BGM_DM_CMN_Pinch_Cue')
DemoScripts[33]=(Actor=EMOTION,Command=SET,Name="アマツカ　パタコ",Number=2,CId=21)
DemoScripts[34]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Surprise_Cue')
DemoScripts[35]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[36]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[37]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_005_Cue',Name="アマツカ　パタコ")
DemoScripts[38]=(Actor=TEXT,Command=SET,ID=TEXT05)
DemoScripts[39]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[40]=(Actor=TEXT,Command=SET,ID=TEXT06)
DemoScripts[41]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=0)
DemoScripts[42]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_007_Cue',Name="アマツカ　パタコ")
DemoScripts[43]=(Actor=TEXT,Command=SET,ID=TEXT07)
DemoScripts[44]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[45]=(Actor=TEXT,Command=SET,ID=TEXT08)
DemoScripts[46]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_009_Cue',Name="エコロ")
DemoScripts[47]=(Actor=TEXT,Command=SET,ID=TEXT09)
DemoScripts[48]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[49]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',Bit=1,Number=5)
DemoScripts[50]=(Actor=SOUND_EX,Command=PLAY,SecTime=1,SoundID=SoundCue'SE_DM_Ekoro_End_bad.GG2_SE_DM_Dark_Aura_LP_Cue')
DemoScripts[51]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_010_Cue',Name="エコロ")
DemoScripts[52]=(Actor=TEXT,Command=SET,ID=TEXT10)
DemoScripts[53]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[54]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0201_lp_half_angry",Rate=1,Number=0,Bit=1)
DemoScripts[55]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_011_Cue',Name="エコロ")
DemoScripts[56]=(Actor=TEXT,Command=SET,ID=TEXT11)
DemoScripts[57]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[58]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0002_fx_close_smile_S",Rate=1,Number=1,Bit=0)
DemoScripts[59]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_012_Cue',Name="エコロ")
DemoScripts[60]=(Actor=TEXT,Command=SET,ID=TEXT12)
DemoScripts[61]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[62]=(Actor=TEXT,Command=SET,ID=TEXT13)
DemoScripts[63]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[64]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[65]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_014_Cue',Name="アマツカ　パタコ")
DemoScripts[66]=(Actor=TEXT,Command=SET,ID=TEXT14)
DemoScripts[67]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[68]=(Actor=TEXT,Command=SET,ID=TEXT15)
DemoScripts[69]=(Actor=SELECT,Command=SET,ID=SELECT00)
DemoScripts[70]=(Actor=SYSTEM,Command=TAG,Label=JUMP01)
DemoScripts[71]=(Actor=ADD,Command=FAVOR,Name="",Number=0)
DemoScripts[72]=(Actor=TEXT,Command=SET,ID=TEXT16)
DemoScripts[73]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_017_Cue',Name="アマツカ　パタコ")
DemoScripts[74]=(Actor=TEXT,Command=SET,ID=TEXT17)
DemoScripts[75]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[76]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_018_Cue',Name="エコロ")
DemoScripts[77]=(Actor=TEXT,Command=SET,ID=TEXT18)
DemoScripts[78]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[79]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",Rate=0,Number=0,Bit=1)
DemoScripts[80]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[81]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=1,Number=2,Bit=0)
DemoScripts[82]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[83]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_019_Cue',Name="エコロ")
DemoScripts[84]=(Actor=TEXT,Command=SET,ID=TEXT19)
DemoScripts[85]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[86]=(Actor=SYSTEM,Command=JUMP,Label=JUMP06)
DemoScripts[87]=(Actor=SYSTEM,Command=TAG,Label=JUMP02)
DemoScripts[88]=(Actor=ADD,Command=FAVOR,Name="",Number=7)
DemoScripts[89]=(Actor=TEXT,Command=SET,ID=TEXT20)
DemoScripts[90]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_021_Cue',Name="アマツカ　パタコ")
DemoScripts[91]=(Actor=TEXT,Command=SET,ID=TEXT21)
DemoScripts[92]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[93]=(Actor=TEXT,Command=SET,ID=TEXT22)
DemoScripts[94]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",Rate=0,Number=0,Bit=1)
DemoScripts[95]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[96]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=1,Number=2,Bit=0)
DemoScripts[97]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[98]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_023_Cue',Name="エコロ")
DemoScripts[99]=(Actor=TEXT,Command=SET,ID=TEXT23)
DemoScripts[100]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[101]=(Actor=SYSTEM,Command=JUMP,Label=JUMP06)
DemoScripts[102]=(Actor=SYSTEM,Command=TAG,Label=JUMP03)
DemoScripts[103]=(Actor=ADD,Command=FAVOR,Name="",Number=7)
DemoScripts[104]=(Actor=TEXT,Command=SET,ID=TEXT24)
DemoScripts[105]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_025_Cue',Name="アマツカ　パタコ")
DemoScripts[106]=(Actor=TEXT,Command=SET,ID=TEXT25)
DemoScripts[107]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[108]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[109]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[110]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_026_Cue',Name="エコロ")
DemoScripts[111]=(Actor=TEXT,Command=SET,ID=TEXT26)
DemoScripts[112]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[113]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",Rate=0,Number=0,Bit=1)
DemoScripts[114]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=1,Number=2,Bit=0)
DemoScripts[115]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[116]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_027_Cue',Name="エコロ")
DemoScripts[117]=(Actor=TEXT,Command=SET,ID=TEXT27)
DemoScripts[118]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[119]=(Actor=SYSTEM,Command=JUMP,Label=JUMP06)
DemoScripts[120]=(Actor=SYSTEM,Command=TAG,Label=JUMP04)
DemoScripts[121]=(Actor=ADD,Command=FAVOR,Name="",Number=7)
DemoScripts[122]=(Actor=TEXT,Command=SET,ID=TEXT28)
DemoScripts[123]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[124]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[125]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0106_fx_Stand2Surprise",Rate=1,Number=2,Bit=0)
DemoScripts[126]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0600_lp_Surprise",Number=8)
DemoScripts[127]=(Actor=EMOTION,Command=SET,Name="アマツカ　パタコ",Number=1,CId=21)
DemoScripts[128]=(Actor=SOUND,Command=PLAY,SoundID=SoundCue'SE_DM_Common.GG2_SE_Manpu_Pressure_Cue')
DemoScripts[129]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0003_lp_open_surprise",Rate=0,Number=0,Bit=1)
DemoScripts[130]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[131]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=0)
DemoScripts[132]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_029_Cue',Name="エコロ")
DemoScripts[133]=(Actor=TEXT,Command=SET,ID=TEXT29)
DemoScripts[134]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[135]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[136]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[137]=(Actor=TEXT,Command=SET,ID=TEXT30)
DemoScripts[138]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0601_fx_Surprise2Stand",Rate=1,Number=2,Bit=0)
DemoScripts[139]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0100_lp_Stand",Number=8)
DemoScripts[140]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0002_lp_open_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[141]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[142]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[143]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_031_Cue',Name="アマツカ　パタコ")
DemoScripts[144]=(Actor=TEXT,Command=SET,ID=TEXT31)
DemoScripts[145]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[146]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",Rate=0,Number=0,Bit=1)
DemoScripts[147]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=1,Number=2,Bit=0)
DemoScripts[148]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[149]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_032_Cue',Name="エコロ")
DemoScripts[150]=(Actor=TEXT,Command=SET,ID=TEXT32)
DemoScripts[151]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[152]=(Actor=SYSTEM,Command=JUMP,Label=JUMP06)
DemoScripts[153]=(Actor=SYSTEM,Command=TAG,Label=JUMP05)
DemoScripts[154]=(Actor=ADD,Command=FAVOR,Name="",Number=-5)
DemoScripts[155]=(Actor=TEXT,Command=SET,ID=TEXT33)
DemoScripts[156]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[157]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[1]="ek_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[158]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_034_Cue',Name="エコロ")
DemoScripts[159]=(Actor=TEXT,Command=SET,ID=TEXT34)
DemoScripts[160]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[161]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[0]="ek_CE_0102_lp_close_tightly",Rate=0,Number=0,Bit=1)
DemoScripts[162]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_0112_fx_Stand2Angry",Rate=1,Number=2,Bit=0)
DemoScripts[163]=(Actor=CHARACTER,Command=ACTION,Name="エコロ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.71_EKORO',motionName[2]="ek_DM_1200_lp_Angry",Number=8)
DemoScripts[164]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_035_Cue',Name="エコロ")
DemoScripts[165]=(Actor=TEXT,Command=SET,ID=TEXT35)
DemoScripts[166]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[167]=(Actor=SYSTEM,Command=JUMP,Label=JUMP06)
DemoScripts[168]=(Actor=SYSTEM,Command=TAG,Label=JUMP06)
DemoScripts[169]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0202_lp_half_perplex",Rate=0,Number=0,Bit=1)
DemoScripts[170]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0001_fx_close_down",Rate=1,Number=1,Bit=0)
DemoScripts[171]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=0)
DemoScripts[172]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_036_Cue',Name="アマツカ　パタコ")
DemoScripts[173]=(Actor=TEXT,Command=SET,ID=TEXT36)
DemoScripts[174]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[175]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[0]="pt_CE_0001_lp_open_angry",Rate=0,Number=0,Bit=1)
DemoScripts[176]=(Actor=CHARACTER,Command=ACTION,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',motionName[1]="pt_CM_0000_fx_close_normal",Rate=1,Number=1,Bit=0)
DemoScripts[177]=(Actor=CHARACTER,Command=PARAM,Name="アマツカ　パタコ",GirlProfile=GG2GirlData'GG2GIrlDatas.ProfileData.21_AMATSUKA_PATAKO',Number=13,Bit=0,Rate=1)
DemoScripts[178]=(Actor=VOICE,Command=PLAY,SoundID=SoundCue'V_DM_Ekoro_ep7_2.GG2_V_Ekoro_ep7_2_037_Cue',Name="アマツカ　パタコ")
DemoScripts[179]=(Actor=TEXT,Command=SET,ID=TEXT37)
DemoScripts[180]=(Actor=VOICE,Command=STOP,SoundID=,Name="")
DemoScripts[181]=(Actor=WINDOW,Command=EXIT)
DemoScripts[182]=(Actor=FADE,Command=SET,SecTime=1,FadeColor=FADE_COLOR_WHITE,FadePriority=FADE_PRIO_FRONT)
DemoScripts[183]=(Actor=SOUND_EX,Command=STOP,SecTime=1,SoundID=)
DemoScripts[184]=(Actor=AMBIENT,Command=STOP,SecTime=1,SoundID=)
DemoScripts[185]=(Actor=BGM,Command=STOP,SecTime=2,SoundID=)
DemoScripts[186]=(Actor=SYSTEM,Command=WAIT,SecTime=2)
DemoScripts[187]=(Actor=SYSTEM,Command=END)

[Select_Ekoro_ep7_2_ENG GG2CollectionSelect]
Selects[0]=(Label="SELECT00",SelectNumber=5,Select[0]=(TextLabel="SELECT01",Goto="JUMP01",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT02",Goto="JUMP02",ParamType=STUDY,ParamNum=30),Select[2]=(TextLabel="SELECT03",Goto="JUMP03",ParamType=SPORT,ParamNum=30),Select[3]=(TextLabel="SELECT04",Goto="JUMP04",ParamType=EROTIC,ParamNum=50),Select[4]=(TextLabel="SELECT05",Goto="JUMP05",ParamType=NO_PARAM,ParamNum=0))
Selects[1]=(Label="SELECT01",SelectNumber=5,Select[0]=(TextLabel="SELECT06",Goto="JUMP06",ParamType=NO_PARAM,ParamNum=0),Select[1]=(TextLabel="SELECT07",Goto="JUMP07",ParamType=NO_PARAM,ParamNum=0),Select[2]=(TextLabel="SELECT08",Goto="JUMP08",ParamType=NO_PARAM,ParamNum=0),Select[3]=(TextLabel="SELECT09",Goto="JUMP09",ParamType=NO_PARAM,ParamNum=0),Select[4]=(TextLabel="SELECT10",Goto="JUMP10",ParamType=NO_PARAM,ParamNum=0))

[Text_Ekoro_ep7_2_ENG GG2CollectionText]
Texts[0]=(Label="TEXT01",Name="峯大",Text="到屋頂了!/n接下來該做什麼啊?/n帕塔可?")

Texts[1]=(Label="TEXT02",Name="帕塔可",Text="好的,條件都湊齊了./n如果是這個校內最靠近天界的地方......")

Texts[2]=(Label="TEXT03",Name="艾可蘿",Text="唔唔唔....../n......帕塔可學姊......這裡是......")

Texts[3]=(Label="TEXT04",Name="峯大",Text="艾可蘿,妳醒來了啊?")

Texts[4]=(Label="TEXT05",Name="帕塔可",Text="這是......糟了!/n請小心!/n峯大學長!!")

Texts[5]=(Label="TEXT06",Name="峯大",Text="咦?")

Texts[6]=(Label="TEXT07",Name="帕塔可",Text="要來了!/n請準備好接招!!")

Texts[7]=(Label="TEXT08",Name="峯大",Text="妳說接招,是什麼意思......?")

Texts[8]=(Label="TEXT09",Name="艾可蘿",Text="峯大大人......為什麼....../n你會和帕塔可學姊在一起呢......?")

Texts[9]=(Label="TEXT10",Name="艾可蘿",Text="帕塔可學姊......明明是我的....../n是隻屬於我的學姊......!")

Texts[10]=(Label="TEXT11",Name="艾可蘿",Text="搶走帕塔可學姊的人類就......殺掉....../n這樣一來,帕塔可學姊就是/n我的人了......")

Texts[11]=(Label="TEXT12",Name="艾可蘿",Text="呵呵呵呵呵呵......")

Texts[12]=(Label="TEXT13",Name="峯大",Text="艾......艾可蘿,妳......怎麼了......?")

Texts[13]=(Label="TEXT14",Name="帕塔可",Text="看來黑暗能量的侵蝕/n比想像中還要來得快....../n峯大大人,請打倒艾可蘿吧!")

Texts[14]=(Label="TEXT15",Name="峯大",Text="打,打倒?")

Texts[15]=(Label="TEXT16",Name="峯大",Text="可是......我不能傷害艾可蘿......!")

Texts[16]=(Label="TEXT17",Name="帕塔可",Text="沒問題!/n因為天使可是很強壯的!!")

Texts[17]=(Label="TEXT18",Name="艾可蘿",Text="......你是想在帕塔可學姊面前耍帥嗎......?/n愚昧的人類......")

Texts[18]=(Label="TEXT19",Name="艾可蘿",Text="果然,人類還是隻能抹殺!!")

Texts[19]=(Label="TEXT20",Name="峯大",Text="打倒她後......有恢復原狀的保證嗎?")

Texts[20]=(Label="TEXT21",Name="帕塔可",Text="是的! 簡單來說就是和/n受到黑暗能量操控的女孩子們一樣!/n峯大學長應該也有印象吧?")

Texts[21]=(Label="TEXT22",Name="峯大",Text="這樣啊......小忍和小真夜也是/n打倒之後就恢復了......!")

Texts[22]=(Label="TEXT23",Name="艾可蘿",Text="人類......不要再繼續....../n和帕塔可學姊說話了......!")

Texts[23]=(Label="TEXT24",Name="峯大",Text="雖然搞不清楚是怎麼回事....../n但就算硬來也要阻止給妳看!")

Texts[24]=(Label="TEXT25",Name="帕塔可",Text="是的! 不必手下留情!/n請動手吧! 峯大學長!!")

Texts[25]=(Label="TEXT26",Name="艾可蘿",Text="帕塔可學姊....../n竟然和區區人類那麼親近......!")

Texts[26]=(Label="TEXT27",Name="艾可蘿",Text="不能原諒不能原諒不能原諒!!")

Texts[27]=(Label="TEXT28",Name="峯大",Text="舔舔咻嚕.")

Texts[28]=(Label="TEXT29",Name="艾可蘿",Text="呀嗚!?/n你你你......你做什麼啊!/n人類!!")

Texts[29]=(Label="TEXT30",Name="峯大",Text="我要用舔的打倒妳!!/n小艾可蘿咻嚕咻嚕.")

Texts[30]=(Label="TEXT31",Name="帕塔可",Text="請用正常的方式打倒她!!")

Texts[31]=(Label="TEXT32",Name="艾可蘿",Text="人類......殺了你!!/n我絕對要殺了你--!!")

Texts[32]=(Label="TEXT33",Name="峯大",Text="沒想到居然是病嬌的發展!?")

Texts[33]=(Label="TEXT34",Name="艾可蘿",Text="人類......總是一直....../n從我身邊......搶走帕塔可學姊......")

Texts[34]=(Label="TEXT35",Name="艾可蘿",Text="絕不原諒!/n要是沒有人類的話......!")

Texts[35]=(Label="TEXT36",Name="帕塔可",Text="抱歉啊,艾可蘿......妳很寂寞吧?/n等妳恢復原狀之後,/n要聊多久我都陪妳.")

Texts[36]=(Label="TEXT37",Name="帕塔可",Text="峯大學長,/n請讓艾可蘿清醒過來吧!")

Texts[37]=(Label="",Name="",Text="")

Texts[38]=(Label="SELECT01",Name="",Text="我沒辦法/n和艾可蘿戰鬥......")

Texts[39]=(Label="SELECT02",Name="",Text="有恢復原狀的/n保證嗎?")

Texts[40]=(Label="SELECT03",Name="",Text="就算硬來/n也要......")

Texts[41]=(Label="SELECT04",Name="",Text="舔舔咻嚕")

Texts[42]=(Label="SELECT05",Name="",Text="沒想到是/n病嬌!?")

Texts[43]=(Label="SELECT06",Name="",Text="")

Texts[44]=(Label="SELECT07",Name="",Text="")

Texts[45]=(Label="SELECT08",Name="",Text="")

Texts[46]=(Label="SELECT09",Name="",Text="")

Texts[47]=(Label="SELECT10",Name="",Text="")


